# ExposureValue Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RenderingImageExposureSettings..::..ExposureValue Property
RenderingImageExposureSettings Class See Also
---
The value of rendering image exposure.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public double ExposureValue { get; set; }
```

Visual Basic
---
```text
Public Property ExposureValue As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double ExposureValue {
	double get ();
	void set (double value);
}
```

# Remarks
Default exposure value based on Lighting Scheme.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: The value of rendering image exposure is not valid. The valid range is 0 to 21. |

# See Also
RenderingImageExposureSettings Class
Autodesk.Revit.DB Namespace